<?php
    //Создать рекурсивную функцию, которое принамает начальное и конечное значение
    //функция должна вывести список нечетных чисел в заданном диапазоне
    //Доработать, чтобы она принимала анонимную callback функцию, которая проверяет число и
    //выдает true\false
    $num1 = 11;
    $num2 = 33;

    function calc ($num1, $num2) {

        for ($i = $num1; $i < $num2; $i++) {
            if (($i % 2) === 1) {
            echo ($i) . '<br>';
            }
        }
    }

    calc($num1, $num2);

?>