<?php
  /*Функция должна принимать в качестве аргумента массив чисел и возвращать так же массив,
  но отсортированный по возрастанию.
  Системные функции сортировки не использовать.
  Пример: В функцию передали [1, 22, 5, 66, 3, 57]. Вернула: [1, 3, 5, 22, 57, 66]
  Дополнительно (не обязательно): Доработать функцию так, чтобы в качестве второго аргумента
  она принимала название функции сортировки. И сортировала массив с использованием этой функции.
  В идеале добавить 2 функции сортировки, одна из которых должна быть задана по умолчанию.*/



  function sort_arr($array) {

    $arr_count = count($array);

    for ($i = 0; $i < $arr_count; $i++) {
      for ($j = $i + 1; $j < $arr_count; $j++) {

        if($array[$i] > $array[$j]) {

          $tmp = $array[$i];
          $array[$i] = $array[$j];
          $array[$j] = $tmp;
        }
      }
    }
    return $array;
  }

  $arr = [1, 23, 45, 55, 23, 77];
  print_r(sort_arr($arr));



?>