<?php
//Создать рекурсивную функцию, которая принамает начальное и конечное значение
//функция должна вывести список нечетных чисел в заданном диапазоне
//Доработать, чтобы она принимала анонимную callback функцию, которая проверяет число и
//выдает true\false

    function recurse ($num1, $num2) {

        if ($num1 <= $num2) {

            if (($num1 % 2) === 1) {
            echo ($num1) . '<br>';
            }
            recurse($num1 + 1, $num2);
        }
    }

    recurse(10, 100);


?>